IdeaRS.Connections
ConnectionCmdData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.ConnectionCmdData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 More...
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ConnectionCmdData : IConnectionCmdData,
	ICopyable
The ConnectionCmdData type exposes the following members.
Constructors
Name | Description
ConnectionCmdData
Initializes a new instance of the ConnectionCmdData class
Top
Properties
Name | Description
IsActive
Name
 Gets or set the name
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
Top
Methods
Name | Description
Equals
Determines whether the specified object is equal to the current object.
 (Inherited from Object.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
Serves as the default hash function.
 (Inherited from Object.)
GetShallowCopy
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
IdeaRS.Connections.Data Namespace
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.AddedMemberData
 IdeaRS.Connections.Data.AnchoringData
 IdeaRS.Connections.Data.BasePlateAnchoringData
 IdeaRS.Connections.Data.BeamSegmentStubData
 IdeaRS.Connections.Data.ConcreteBlockData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.ConnectorGridData
 IdeaRS.Connections.Data.CutBeamByBeamData
 IdeaRS.Connections.Data.CutCommandData
 IdeaRS.Connections.Data.CutPlateData
 IdeaRS.Connections.Data.DissipativeItemCommandData
 IdeaRS.Connections.Data.FasteningData
 IdeaRS.Connections.Data.GeneralWeldData
 IdeaRS.Connections.Data.PlateOpeningData
 IdeaRS.Connections.Data.WorkPlaneData